# pandas

# 2. DataFrame

## 2.1 DataFrame 생성

In [2]:
import pandas as pd

# 1. 하나의 열이되는 데이터를 리스트나 1차원 배열로 준비
col1 = [1, 2]
col2 = [3, 4] 

# 2. 이 각각의 열에 대한 이름(label)을 키로 갖는 딕셔너리르 만듦 
d = {'col1': col1, 'col2': col2}

# 3. d 객체를 DataFrame 클래스 생성자에 넣기
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [86]:
# 더 많은 데이터로 DF 만들기 

# 데이터 정의
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2450616],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

# 컬럼과 인덱스 정의
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]

# DataFrame 생성
df = pd.DataFrame(data, index=index, columns=columns)

# DataFrame 출력
display(df)
print()

# 각 컬럼의 데이터 타입 확인
print(df.dtypes)

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2450616  2473990         0.0141

지역                object
2015               int64
2010               int64
2005               int64
2000               int64
2010-2015 증가율    float64
dtype: object

## 2.2 values, columns, index에 접근

In [87]:
# values에 접근
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2450616, 2473990, 0.0141]], dtype=object)

In [88]:
# columns(열 이름)에 접근
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [89]:
# index(행 이름)에 접근 
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

## 2.3 DF에 이름 붙이기

In [90]:
df.index.name = '도시'
df.columns.name = '특성'
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2450616  2473990         0.0141

## 2.4 실습 01

[문제] 아래의 조건을 만족하는 DatFrame을 생성 해보세요
- column의 개수와 row의 개수가 각각 4개 이상이어야 합니다.
- column에는 정수, 문자열, 실수 자료형 데이터 각각 1개 이상씩 포함되어 있어야 합니다.

In [99]:
data = {
    'my_int': [1, 1., 'a', True],
    'my_float': [2, 2., 'b', True],
    'my_str': [3, 3., 'c', False],
    'my_bool': [4, 4., 'd', False]
}

my_df = pd.DataFrame(data)

my_df

  my_int my_float my_str my_bool
0      1        2      3       4
1    1.0      2.0    3.0     4.0
2      a        b      c       d
3   True     True  False   False

## 2.5 전치 (Transpose)
- 전치 뿐만 아니라 NumPy 2차원 배열이 갖는 대부분의 속성이나 메서드 지원

In [96]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2450616
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

## 2.6 column 추가, 갱신, 삭제
- DF는 Column을 Series의 딕셔너리로 볼 수 있음
- Column 단위로 데이터를 갱신하거나 추가, 삭제할 수 있음

In [101]:
# 데이터 정의
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2450616],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

# 컬럼과 인덱스 정의
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]

# DataFrame 생성
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2450616  2473990         0.0141

1. 갱신 (column 한 개 값 업데이트)

In [102]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2450616  2473990           1.41

2. column 추가

In [103]:
df['2005-2010 증가율'] = ((df['2010'] - df['2005']) / df['2005'] * 100).round(2) # 둘 째 자리까지 반올림 
df

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2450616  2473990           1.41          -0.77

3. column 삭제

In [104]:
del df['2010-2015 증가율']
df

     지역     2015     2010     2005     2000  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2450616  2473990          -0.77

## 2.7 column 인덱싱 

- DataFrame을 인덱싱을 할 때도 column label을 키(key)로 생각하여 인덱싱을 할 수 있음
- index로 label 값을 하나만 넣으면 Series 객체가 반환됨 (column 하나는 시리즈임)

In [3]:
# 데이터 정의
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2450616],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

# 컬럼과 인덱스 정의
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]

# DataFrame 생성
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2450616  2473990         0.0141

In [4]:
print(df['지역'])
print()
print(df['2010'])

서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [5]:
type(df['지역']) # series임을 알 수 있음

pandas.core.series.Series

- label의 배열 또는 리스트로 인덱싱 하면 DataFrame타입 반환

In [8]:
import numpy as np 

label_list = ['2010', '2015']
label_array = np.array(label_list)

display(df[label_list])
print(type(df[label_list]))
print()
display(df[label_array])
print(type(df[label_array]))

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

<class 'pandas.core.frame.DataFrame'>

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

<class 'pandas.core.frame.DataFrame'>

In [10]:
df[['2010', '2015']]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

- column 한 개만 빼내더라도 df를 유지하고 싶으면, 요소가 하나인 리스트 자료형을 사용해서 인덱싱 하면 됨

In [12]:
display(df[['2010']])
print(type(df[['2010']]))

       2010
서울  9631482
부산  3393191
인천  2632035
대구  2431774

<class 'pandas.core.frame.DataFrame'>

- 정수형 column index를 갖는 경우 -> index값으로 정수 사용 가능

In [16]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [18]:
display(df2[2]) # 정수로 column을 선택할 수 있음 
print(type(df2[2]))

0     2
1     6
2    10
Name: 2, dtype: int64

<class 'pandas.core.series.Series'>

In [20]:
display(df2[[1, 2]])
print(type(df2[[1, 2]]))

   1   2
0  1   2
1  5   6
2  9  10

<class 'pandas.core.frame.DataFrame'>

## 2.8 슬라이싱 (row indexing)

- row 단위로 인덱싱을 하고자 하면 항상 slicing을 해야 함 
- index의 값이 문자 label이면 label 슬라이싱도 가능

In [22]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]

df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [23]:
df[:1] #  df[:'서울'] -> 문자는 포함 숫자는 미포함

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283

- row가 부산인 결과만 보고싶을 경우 
- 단, 한 줄이기 때문에 문자열로 슬라이싱할 경우 ['부산':'부산']으로 슬라이싱

In [24]:
df[1:2]

     지역     2015     2010     2005     2000  2010-2015 증가율
부산  경상권  3448737  3393191  3512547  3655437         0.0163

In [25]:
df['부산':'부산']

     지역     2015     2010     2005     2000  2010-2015 증가율
부산  경상권  3448737  3393191  3512547  3655437         0.0163

## 2.9 개별 데이터 인덱싱

1. DataFrame에서 column 인덱싱으로 Series 뽑기 
2. Series에서 row 인덱싱으로 개별 데이터 뽑기  

즉, columns label -> row label 순으로 인덱싱

In [26]:
df['2015']['서울']

np.int64(9904312)

In [27]:
type(df['2015']['서울'])

numpy.int64

## 실습 02

다음 DataFrame을 활용하여 아래 문제를 해결해보세요.
- 모든 학생의 수학 점수를 Series로 나타낸다.
- 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
- 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
- 춘향의 점수를 DataFrame으로 나타낸다.
- 향단의 점수를 Series로 나타낸다.

In [29]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]

df = pd.DataFrame(data, index=index, columns=columns)

1. 모든 학생의 수학 점수를 Series로 나타낸다.

In [30]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

2. 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

In [31]:
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

3. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

In [34]:
df['평균'] = round((df['국어'] + df['영어'] + df['수학']) / 3, 2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [37]:
df.mean(axis=1)

춘향    86.6675
몽룡    73.3325
향단    70.0000
방자    46.6675
dtype: float64

4. 춘향의 점수를 DataFrame으로 나타낸다.

In [35]:
df[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

5. 향단의 점수를 Series로 나타낸다.

In [36]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64